#include "Code_Classesr.h"
#include <iostream>
using namespace std;

void View_of_the_Main_screen::Epigraph() {
	View_of_the_Main_screen* Menu_Center_screen = new View_of_the_Main_screen;
	string team_1;
	int key_1, key_2, key_3, quantity_sign=0, exit_sign=0;
	do {
		
		
		id= quantity_sign;//Проверка
		cout << "******** id = " << id << "**********" << endl;//Проверка
		
		cout << "                      *       ^^                                            &&         *               " << endl;
		cout << "                *            -[]-             = = = = = = = = = = =        -[]-                " << endl;
		cout << "                         *    ||              =  Добро пожаловать =    *    ||\n                             *                =                   =\n                              *               =     LagaetCar2    =    *        *" << endl;
		cout << "        = = = = = = = = = = = = = = = = = = = =                   = = = = = = = = = = = = = = = = = = =" << endl;
		cout << "        =                                                                                             =\n        =  Для управления этим приложением вписывайте слова, которые выделены квадратными скобками [] =" << endl;
		cout << "        = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = =" << endl;
		cout << "                \n   \n                            *       [Авторы] *                *       [Выход]      * *   \n                                *                  [Продолжить]  * " << endl;
		cout << "                             \n   \n               *                 [Подробности]      *                [Инструкция]     *     * " << endl;
		cout << "        _______________________________________________________________________________________________" << endl;



		if (exit_sign == 1) {
			team_1 = "Выход";
         }
		else {
			cout << "\n\n+++++++" << endl;
			cin >> team_1;
		}

		if ("Продолжить" == team_1) {
						
			Menu_Center_screen->Menu_Center(&quantity_sign,&exit_sign);
			cout << "#### kpt = " << quantity_sign << "####" << endl;//Проверка
			cout << "#### exit_sign = " << exit_sign << "####" << endl;//Проверка

			key_1 = 0;
		}
		else if ("Авторы" == team_1) {
			key_1 = 0;
			cout << " Это Авторы\n\n\n\n\n\n\n)()()()()()()()()()()()" << endl;
			cout << "     _______________________________________________________________________________________________\n" << endl;
		}
		else if ("Выход" == team_1) {
			key_1 = 1;
			cout << "До свидания" << endl;
			cout << "     _______________________________________________________________________________________________\n" << endl;
		}
		else if ("Инструкция" == team_1) {
			key_1 = 0;
			cout << "Это инструкция" << endl;
			cout << "     _______________________________________________________________________________________________\n" << endl;
		}
		else if ("Подробности" == team_1) {
			key_1 = 0;
			cout << "Это подробности" << endl;
			cout << "     _______________________________________________________________________________________________\n" << endl;
		}
		else {
			key_1 = 0;
			cout << "Не верно!\nПовторите ввод!" << endl;
			cout << "     _______________________________________________________________________________________________\n" << endl;
		}
	} while (0 == key_1);

}